# Using Python Dictionary:

In [4]:
import pandas as pd

data_dict = {'Name': ['John', 'Cataline', 'Matt'],
        'Age': [50, 45, 30],
        'City': ['Austin', 'San Francisco', 'Boston'],
        'Marks' : [70, 80, 95]}

df = pd.DataFrame(data_dict)

In [5]:
df

       Name  Age           City  Marks
0      John   50         Austin     70
1  Cataline   45  San Francisco     80
2      Matt   30         Boston     95

In [6]:
data_list = [['John', 25, 'Austin',70],
        ['Cataline', 30, 'San Francisco',80],
        ['Matt', 35, 'Boston',90]]

columns = ['Name', 'Age', 'City', 'Marks']

df = pd.DataFrame(data_list, columns=columns)

In [7]:
df

       Name  Age           City  Marks
0      John   25         Austin     70
1  Cataline   30  San Francisco     80
2      Matt   35         Boston     90

In [8]:
df['Age'].value_counts()

Age
25    1
30    1
35    1
Name: count, dtype: int64